Всем привет. Тут вся информация

2.2 Разбор задач
Для примера разберем данные задачи
№19. 
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в кучу один или четыре камня или увеличить количество камней в куче в два раза. У каждого игрока, чтобы делать ходы, есть неограниченное количество камней.
Игра завершается в тот момент, когда количество камней в куче становится не менее 48.
Победителем считается игрок, сделавший последний ход, т. е. первым получивший кучу, в которой будет 48 или больше камней.
В начальный момент в куче было S камней; 1 ≤ S ≤ 47.
Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника. Описать стратегию игрока — значит, описать, какой ход он должен сделать в любой ситуации, которая ему может встретиться при различной игре противника. В описание выигрышной стратегии не следует включать ходы играющего по этой стратегии игрока, не являющиеся для него безусловно выигрышными, т. е. не являющиеся выигрышными независимо от игры противника.
Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите минимальное значение S, когда такая ситуация возможна.
№20.
Найдите два таких значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
— Петя не может выиграть за один ход;
— Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания без разделительных знаков.
№21.
Найдите минимальное значение S, при котором одновременно выполняются два условия:
— у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
— у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
 
2.2.1 Решение при помощи таблицы
Решение задачи №19
Ходом Вани должно быть «*2», т.к. ему нужно выиграть на своем первом ходе, следовательно, рассматривать другие возможные ходы бесполезно. 
48/2 = 24 (Это выигрышная позиция для Вани)
24-1 = 23 (Это проигрышная позиция для Пети)
Минимально значение S, с которого Ваня может получить выигрышную позицию  24/2=12 – это ответ на эту задачу.
Составим таблицу, в которой «В1» обозначает выигрыш за один ход, «П1» обозначает проигрыш за один ход.
S	9	10	11	12	13	14	15	16	17	18	19	20	21	22	23	24	…	47
															П1	В1	…	В1

Решение задачи №20
Для того, чтобы Петя смог выиграть своим вторым ходом, ему нужно своим первым ходом перевести игру в проигрышную (для Вани) позицию, т.е., получить 23 камней. Он может сделать это при S = 19 (ходом «+4») или при S = 22 (ходом «+1»). 
Ответы на эту задачу – 19 и 22.
В таблице обозначим эти позиции как выигрышные за 2 хода.
S	9	10	11	12	13	14	15	16	17	18	19	20	21	22	23	24	…	47
											В2			В2	П1	В1	…	В1

Решение задачи №21
Нужно найти такие позиции, из которых все возможные ходы ведут в выигрышные позиции, помеченные как В1 или В2; это позиция S = 18 при S = 18 можно получить 19, 22 или 36 камней, все эти позиции выигрышные; 
Ответ на эту задачу – 18.
 
Строим дерево игры, рассматривая на каждом шаге все возможные ходы Пети и только выигрышный ход Вани:
 
У нас получилось не совсем дерево, потому что на первом ходу Ваня из двух позиций (S=19 и S=22) приводит игру к проигрышной для Пети позиции S=23. Для сокращения записи можно привести стрелки в один узел. Зелёные прямоугольники обозначают выигрыш Вани.


 
2.2.2 Решение при помощи Excel
Решение задачи №19
1.	Делаем три столбца – S, Петя, Ваня. (Приложение 1)
2.	В столбце Петя прописываем возможные ходы этого игрока. (Приложение 2)
3.	В столбце Ваня прописываем его максимальный ход, т.к. ему надо выиграть. (Приложение 3)
4.	В столбце S перебираем значения, до того момента, пока Ваня не выиграет хотя бы один раз – это будет минимально значение S.
Получаем ответ – 12. (Приложение 4)
Решение задачи №20
1.	Добавляем еще один столбец – Петя
2.	Создаем 3 пути развития событий. (Приложение 5)
3.	Перебираем числа и рассматриваем возможные пути. Нам нужно найти путь, в котором во всех исходах побеждает только Петя.
Получаем ответ - 19 и 22. (Приложение 6 и 7)
Решение задачи №21
1.	Добавляем еще один столбец – Ваня.
2.	Оставляем три пути для Пети и к этим трем путям добавляем пути для Вани. (Приложение 8)
3.	Перебираем и числа и ищем такое значение, при котором в каждом пути, будет хоть один выигрышный под путь для Вани.
Получаем ответ – 18. (Приложение 9)

 
2.2.3 Решение при помощи программирования (Java&Python)
Решение задачи №19
1.	Создаем функцию, которая определяет, является ли позиция выигрышная за один ход.
(JAVA)
static boolean win1(int s) {
  return s+1 >= 47 || s+4 >= 47 || s*2 >= 47;
}
(PYTHON) 
def win1(s):
    return s + 1 >= 47 or s + 4 >= 47 or s * 2 >= 47

2.	Создаем функцию, которая определяет, является ли позиция проигрышная. Учитываем только умножение на 2, т.к. Ване нужно выиграть своим первым ходом. И нам не нужно учитывать другие его ходы (по условию задачи).
(JAVA)
static boolean loss1(int s) {
 return (!win1(s)) && win1(s*2);
}
(PYTHON) 
def loss1(s):
    return not (win1(s)) and win1(s * 2)

3.	Делаем перебор значений через цикл.
(JAVA)
public static void main(String[] args) {
 for (int i = 0; i < 48; i++) 
    if (loss1(i)) {
      System.out.println(i);
      break;
    }
}
(PYTHON)
for i in range (0, 48):
    if loss1(i):
        print(i)
        break

Получаем ответ – 12.
Решение задачи №20
1.	Дополняем функцию “loss1”, добавляя в нее прибавление 1 и 4 камней.
(JAVA)
static boolean loss1(int s){
 return (!win1(s)) && win1(s*2) && win1(s+1) && win1(s+4);
}
(PYTHON)
def loss1(s):
    return not (win1(s)) and win1(s * 2) and win1(s + 1) and win1(s + 4)

2.	Создаем функцию, которая определяет, является ли позиция выигрышная за два хода.
(JAVA)
static boolean win2(int s) {
  return loss1(s+1) || loss1(s+4) || loss1(s*2);
}
(PYTHON)
def win2(s):
    return loss1(s * 2) or loss1(s + 1) or loss1(s + 4)

3.	Делаем перебор значений через цикл.
(JAVA)
public static void main(String[] args) {
  for (int i = 0; i < 48; i++) 
    if (win2(i)) 
      System.out.println(i);
}
(PYTHON)
for i in range(0, 48):
    if win2(i):
        print(i)

Получаем ответы – 19 и 22
Решение задачи №21
1.	Создаем функцию, которая определяет, является ли позиция проигрышной за 1 или 2 хода.
 
(JAVA)
static boolean loss12(int s) {
      return win1(s+1) && win2(s+4) && win2(s*2) ||
          win1(s+4) && win2(s+1) && win2(s*2) ||
          win1(s*2) && win2(s+1) && win2(s+4);
}
(PYTHON)
def loss12(s):
    return win1(s + 1) and win2(s + 4) and win2(s * 2) or win1(s + 4) and win2(s + 1) and win2(s * 2) or win1(s* 2) and win2(s + 1) and win2(s + 4)

2.	Делаем перебор значений через цикл.
(JAVA)
public static void main(String[] args) {
  for (int i = 0; i < 48; i++) 
    if (loss12(i))
      System.out.println(i);
}
(PYTHON)
for i in range(0, 48):
    if loss12(i):
        print(i)

Получаем ответ – 18.
 

